Revit 2024 API
BuiltInFailures.RevolutionFailures.CannotDrawRevolution Property
 Can't create surface of revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawRevolution { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawRevolution As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawRevolution {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RevolutionFailures Class
Autodesk.Revit.DB Namespace